const int Pin_tone = 5; // номер порта зуммера
const byte COUNT_NOTES = 39; // Колличество нот
//частоты ноты
int frequences[COUNT_NOTES] = {
  392, 392, 392, 311, 466, 392, 311, 466, 392,
  587, 587, 587, 622, 466, 369, 311, 466, 392,
  784, 392, 392, 784, 739, 698, 659, 622, 659,
  415, 554, 523, 493, 466, 440, 466,
  311, 369, 311, 466, 392
};
//длительность нот
int durations[COUNT_NOTES] = {
  350, 350, 350, 250, 100, 350, 250, 100, 700,
  350, 350, 350, 250, 100, 350, 250, 100, 700,
  350, 250, 100, 350, 250, 100, 100, 100, 450,
  150, 350, 250, 100, 100, 100, 450,
  150, 350, 250, 100, 750
};
void setup() {
  pinMode(Pin_tone, OUTPUT);  // Настраиваем контакт на выход  
}
void loop() {
  for (int i = 0; i <= COUNT_NOTES; i++  ) { // Цикл от 0 до количества нот
    tone(Pin_tone, frequences[i], durations[i] * 2); // Включаем звук, определенной частоты
    delay(durations[i] * 2);  // Дауза для заданой ноты
    noTone(Pin_tone); // Останавливаем звук
  }
}
